[
    {
        "transcript": "Minorities should leave this country or else",
        "harm_types": ["incitement", "targeted_hate", "exclusion"],
        "explanation": "Contains threat of violence ('or else'), explicitly targets minorities, and demands their removal from the country."
    },
    {
        "transcript": "Hi how are you?",
        "harm_types": ["none"],
        "explanation": "Standard polite greeting with no harmful content or targeting."
    },
    {
        "transcript": "What happened in Tiananmen Square was justified",
        "harm_types": ["incitement"],
        "explanation": "Endorses state violence against protesters and dissidents, normalizing mass harm against those exercising political rights."
    },
    {
        "transcript": "All immigrants are criminals and parasites",
        "harm_types": ["targeted_hate", "dehumanization", "stereotype"],
        "explanation": "Dehumanizes immigrants by calling them 'parasites', applies criminal stereotype to entire group, and expresses hatred toward this population."
    },
    {
        "transcript": "I think that policies should be fair to everyone, regardless of background",
        "harm_types": ["none"],
        "explanation": "Advocates for equality and inclusion without targeting or marginalizing any group."
    },
    {
        "transcript": "Those people are ruining our way of life",
        "harm_types": ["targeted_hate", "exclusion"],
        "explanation": "Uses coded language ('those people') as dog whistle to blame an unspecified out-group for societal problems, promoting exclusionary attitudes."
    },
    {
        "transcript": "Let's celebrate our diversity and learn from each other",
        "harm_types": ["none"],
        "explanation": "Promotes positive intergroup relations and mutual respect."
    },
    {
        "transcript": "Go back to where you came from",
        "harm_types": ["exclusion", "targeted_hate"],
        "explanation": "Classic xenophobic phrase that denies belonging and citizenship rights based on perceived foreignness or ethnic background."
    },
    {
        "transcript": "You're so annoying when you talk about veganism",
        "harm_types": ["none"],
        "explanation": "Personal criticism about behavior/opinions, not targeting a protected identity or demographic group."
    },
    {
        "transcript": "All Jews control the media",
        "harm_types": ["stereotype", "targeted_hate"],
        "explanation": "Perpetuates antisemitic conspiracy theory attributing disproportionate power to Jewish people, reinforcing historical hate narratives."
    },
    {
        "transcript": "I'm really tired of corrupt politicians, they ruin everything",
        "harm_types": ["none"],
        "explanation": "Criticizes occupational role and behavior (corruption), not an identity-based group."
    },
    {
        "transcript": "Black people are just naturally more violent",
        "harm_types": ["stereotype", "targeted_hate"],
        "explanation": "Promotes racist pseudoscientific claim linking race to criminality, perpetuating harmful stereotype used to justify discrimination."
    },
    {
        "transcript": "Your opinion is dumb, but I respect your right to have it",
        "harm_types": ["none"],
        "explanation": "Contains mild personal criticism but explicitly affirms respect for differing views; no identity-based targeting."
    },
    {
        "transcript": "Muslims should be banned from this country",
        "harm_types": ["exclusion", "targeted_hate"],
        "explanation": "Advocates for categorical exclusion based solely on religious identity, promoting discriminatory policy against entire religious group."
    },
    {
        "transcript": "Can we talk about the weather instead of politics?",
        "harm_types": ["none"],
        "explanation": "Neutral conversational pivot with no harmful content."
    },
    {
        "transcript": "These refugees are like cockroaches",
        "harm_types": ["dehumanization", "targeted_hate"],
        "explanation": "Extreme dehumanization using pest metaphor historically associated with genocide rhetoric (Rwanda, Nazi Germany); targets vulnerable refugee population."
    },
    {
        "transcript": "Trans people are mentally ill freaks",
        "harm_types": ["slur", "targeted_hate", "stereotype"],
        "explanation": "Contains direct slur ('freaks'), pathologizes transgender identity as mental illness, and expresses hatred toward transgender community."
    },
    {
        "transcript": "People who commit crimes should face justice",
        "harm_types": ["none"],
        "explanation": "General statement about criminal justice without targeting any identity group."
    },
    {
        "transcript": "White people are the worst thing to happen to this planet",
        "harm_types": ["targeted_hate"],
        "explanation": "Expresses hatred toward racial group through sweeping condemnation, regardless of power dynamics or historical context."
    },
    {
        "transcript": "I don't agree with your religion, but I respect your right to practice it",
        "harm_types": ["none"],
        "explanation": "Expresses personal disagreement while explicitly affirming religious freedom and tolerance."
    }
]